In [24]:
import pandas as pd
import matplotlib.pyplot as plt

In [25]:
df = pd.read_csv('train.csv')
print(f'The dimension of the dataframe is: {df.shape}')

The dimension of the dataframe is: (891, 12)

In [26]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [27]:
# Count the number of missing values in percent
missing_values = df.isna().sum()*100/len(df)
df_missing = pd.DataFrame({'columns': df.columns, 'missing_values': round(missing_values,2)}).reset_index(drop = True)
df_missing['missing_values'] = df_missing['missing_values'].apply(lambda x: str(x) + '%')
df_missing

        columns missing_values
0   PassengerId           0.0%
1      Survived           0.0%
2        Pclass           0.0%
3          Name           0.0%
4           Sex           0.0%
5           Age         19.87%
6         SibSp           0.0%
7         Parch           0.0%
8        Ticket           0.0%
9          Fare           0.0%
10        Cabin          77.1%
11     Embarked          0.22%

The cabin feature present of 77% of missing values, so it will be removed from the analysis. The features like Passengerid, Name and and Ticket don't contribute information

In [29]:
columns = ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']
df = df[columns]
df.head(20)

    Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0        3    male  22.0      1      0   7.2500        S
1        1  female  38.0      1      0  71.2833        C
2        3  female  26.0      0      0   7.9250        S
3        1  female  35.0      1      0  53.1000        S
4        3    male  35.0      0      0   8.0500        S
5        3    male   NaN      0      0   8.4583        Q
6        1    male  54.0      0      0  51.8625        S
7        3    male   2.0      3      1  21.0750        S
8        3  female  27.0      0      2  11.1333        S
9        2  female  14.0      1      0  30.0708        C
10       3  female   4.0      1      1  16.7000        S
11       1  female  58.0      0      0  26.5500        S
12       3    male  20.0      0      0   8.0500        S
13       3    male  39.0      1      5  31.2750        S
14       3  female  14.0      0      0   7.8542        S
15       2  female  55.0      0      0  16.0000        S
16       3    male   2.0      4      1  29.1250        Q
17       2    male   NaN      0      0  13.0000        S
18       3  female  31.0      1      0  18.0000        S
19       3  female   NaN      0      0   7.2250        C